app/controllers/registration_controller.rb

  def index
  	@contents = Content.new
  	@posts = Content.all
---
SELECT `contents`.* FROM `contents`

  def submit
  	@content = Content.new
    @content.commenter = params[:content][:content_commenter]
    @content.body = params[:content][:content_body]

  	if @content.save
---
INSERT INTO `contents` (`body`, `commenter`, `created_at`, `updated_at`) VALUES ('Text 1', 'Dinesh', '2012-09-17 23:50:05', '2012-09-17 23:50:05')

  def destroy
  		@post = Content.find(params[:id])
		@post.destroy
---
SELECT `contents`.* FROM `contents` WHERE `contents`.`id` = 5 LIMIT 1
DELETE FROM `contents` WHERE `contents`.`id` = 5